// Вывести на экран кодировку символов по ASCII(с 32 до 122)

for(int c=32;c<123;c++) {
    Console.Write($"{(char)c} ");
}

